libs/XML_Encryption_Attack_Library/src/test/resources/case_encData_signed_no_id.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1">
<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-3">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsa soapenv" />
</ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
<ds:Reference URI="#id-2">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="" /></ds:Transform></ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><ds:DigestValue>0/xb/h9BK7zWB4yts9r8P2hsmxI=</ds:DigestValue></ds:Reference></ds:SignedInfo>
<ds:SignatureValue>OW7xwaewXVna4J+Re1CA3HVnDo16hBHxijK/WYNm/ehueIC1ihl8IaHErgmKROtcDYXVc5iI9pEdT4LJfsl7dvW45CKsFcBY7anVcwQ9QfYRwEH9uCDzBcU7p8hdElVC633nJbd5Zq7Of9XrGyWkHxA2B77hNaVZKf6gMNMWntw=</ds:SignatureValue>
<ds:KeyInfo Id="KI-7842FCDF3196D3DD9213871899393152"><wsse:SecurityTokenReference wsu:Id="STR-7842FCDF3196D3DD9213871899393183">
<wsse:Reference URI="#X509-7842FCDF3196D3DD9213871899392981" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" /></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature>
<wsu:Timestamp wsu:Id="TS-1">
<wsu:Created>2013-12-16T10:32:19.285Z</wsu:Created>
<wsu:Expires>2013-12-16T10:37:19.285Z</wsu:Expires>
</wsu:Timestamp>
</wsse:Security><wsa:To>http://localhost:8081/axis2/services/s5a9ample06</wsa:To>
<wsa:MessageID>urn:uuid:74f7fe82-437a-4125-a80d-02db3aa18838</wsa:MessageID>
<wsa:Action>urn:echo</wsa:Action></soapenv:Header>
<soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-2">
<xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content" >
<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" />
<xenc:CipherData><xenc:CipherValue>vgfFucuY8GHvtgxa2fd6ClNzCIlAtPT5DjPEirQGfkQG54PD/hMxndKXo1XiVj01bf/70in4tjHCXSGjLzYmAdsPfUn+lowHE/zgq6KAAzxAxcfCQ6ta7qzbOI9yVzYmFRKywGZQ88VMOIA6sDr6xw5fm0KCPAkFbIse1DqRhXWeTjGNvOFPNCdxI+4NRNZFwJzceVS7LuZFzTi0jVA3hZ7CLfq8KwTShJwJiSG6PKnBkWr1ewiD4CDxjMCWVTonnCapSPp4MGJlMM9yB+7Tytv6zJpx5Hru89wXg97DUB5g7xuCZ1mR97XBcvT7GXKF9ji5LNgBlWrN+CJvgTF8JNGqrUDC6vwBD51fXI2b2hkfeqS9W605ntOPRWOWJrxm</xenc:CipherValue>
</xenc:CipherData>
</xenc:EncryptedData>
</soapenv:Body>
</soapenv:Envelope>
